export const Pmos=[
    [
     {
      "milestone": "الانتهاء من إجراءات استلام الموقع",
      "weight": 0.1,
      "rate": 1,
      "id": "PO\/2022\/01812",
      "project": "مشروع تنفيذ أعمال الترميم والتأهيل والتطوير لعدد من المبانى التراثية فى مناطق المملكة ( المرحلة الاولى )",
     },
     {
      "milestone": "الانتهاء من اعمال تهيئة الموقع",
      "weight": 0.03,
      "rate": 1,
      "id": "PO\/2022\/01813"
     },
     {
      "milestone": "الانتهاء من اعمال الازالة للعناصر المتهالكة وفرزها و حفظ الصالح منها للاستخدام",
      "weight": 0.03,
      "rate": 0.08,
      "id": "PO\/2022\/01814"
     },
     {
      "milestone": "الالنتهاء من اعمال التدعيم الانشائي للعناصر الآيلة للسقوط",
      "weight": 0.07,
      "rate": 0.09,
      "id": "PO\/2022\/01815"
     },
     {
      "milestone": "الانتهاء من اعمال الترميمات للعناصر المعمارية ( الحوائط ، الأسوار ، الاسقف ، الاسطح ، الموقع العام ، الأبواب والشبابيك  ) المرحلة 1",
      "weight": 0.04,
      "rate": 0.03,
      "id": "PO\/2022\/01816"
     },
     {
      "milestone": "الانتهاء من اعمال الترميمات للعناصر المعمارية ( الحوائط ، الأسوار ، الاسقف ، الاسطح ، الموقع العام ، الأبواب والشبابيك  ) المرحلة 2",
      "weight": 0.04,
      "rate": 0.03,
      "id": "PO\/2022\/01817"
     },
     {
      "milestone": "الانتهاء من اعمال الترميمات للعناصر المعمارية ( الحوائط ، الأسوار ، الاسقف ، الاسطح ، الموقع العام ، الأبواب والشبابيك  ) المرحلة 3",
      "weight": 0.04,
      "rate": 0.03,
      "id": "PO\/2022\/01818"
     },
     {
      "milestone": "الانتهاء من اعمال الترميمات للعناصر المعمارية ( الحوائط ، الأسوار ، الاسقف ، الاسطح ، الموقع العام ، الأبواب والشبابيك  ) المرحلة 4",
      "weight": 0.04,
      "rate": 0.03,
      "id": "PO\/2022\/01819"
     },
     {
      "milestone": "الانتهاء من اعمال الترميمات للعناصر المعمارية ( الحوائط ، الأسوار ، الاسقف ، الاسطح ، الموقع العام ، الأبواب والشبابيك  ) المرحلة 5",
      "weight": 0.04,
      "rate": 0,
      "id": "PO\/2022\/01820"
     },
     {
      "milestone": "الانتهاء من اعمال الترميمات للعناصر المعمارية ( الحوائط ، الأسوار ، الاسقف ، الاسطح ، الموقع العام ، الأبواب والشبابيك  ) المرحلة 6",
      "weight": 0.04,
      "rate": 0,
      "id": "PO\/2022\/01821"
     },
     {
      "milestone": "الانتهاء من أعمال العزل للأسطح المرحلة 1",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2022\/01822"
     },
     {
      "milestone": "الانتهاء من أعمال العزل للأسطح المرحلة 2",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2022\/01823"
     },
     {
      "milestone": "الانتهاء من اعمال تركيب وتشغيل الأنظمة الكهروميكانيكية المرحلة 1",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2022\/01824"
     },
     {
      "milestone": "الانتهاء من اعمال تركيب وتشغيل الأنظمة الكهروميكانيكية المرحلة 2",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2022\/01825"
     },
     {
      "milestone": "الانتهاء من اعمال اختبارات الجودة للعناصر المعمارية",
      "weight": 0.02,
      "rate": 0,
      "id": "PO\/2022\/01826"
     },
     {
      "milestone": "الانتهاء من اعمال اختبارات الجودة للأنظمة الكهروميكانيكية",
      "weight": 0.02,
      "rate": 0,
      "id": "PO\/2022\/01827"
     },
     {
      "milestone": "الانتهاء من أعمال عزل الأسوار والحوائط واختبارها",
      "weight": 0.05,
      "rate": 0,
      "id": "PO\/2022\/01828"
     },
     {
      "milestone": "الانتهاء من اعمال الفحص الأولي للموقع وتدوين الملاحظات المرحلة 1",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2022\/01829"
     },
     {
      "milestone": "الانتهاء من اعمال الفحص الأولي للموقع وتدوين الملاحظات المرحلة 2",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2022\/01830"
     },
     {
      "milestone": "الانتهاء من اعمال الفحص الأولي للموقع وتدوين الملاحظات المرحلة 3",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2022\/01831"
     },
     {
      "milestone": "الانتهاء من استلام الملاحظات",
      "weight": 0.05,
      "rate": 0,
      "id": "PO\/2022\/01832"
     },
     {
      "milestone": "الانتهاء من اعمال الفحص النهائي",
      "weight": 0.05,
      "rate": 0,
      "id": "PO\/2022\/01833"
     },
     {
      "milestone": "استلام الموقع",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2022\/01834"
     },
     {
      "milestone": "الانتهاء من اعمال اغلاق المشروع",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2022\/01835"
     }
    ],
    [
     {
      "milestone": "الانتهاء من تسليم المواقع",
      "weight": 0.01,
      "rate": 1,
      "id": "PO\/2023\/00059",
      "project": "أعمال التأهيل والترميم لموقعى برج الشنانة والقصيباء"
     },
     {
      "milestone": "الانتهاء من الاعمال التجهيزية للموقع تمهيدا للبدء بالتنفيذ",
      "weight": 0.06,
      "rate": 1,
      "id": "PO\/2023\/00060"
     },
     {
      "milestone": "الانتهاء من اعتماد المخططات التنفيذية",
      "weight": 0.06,
      "rate": 1,
      "id": "PO\/2023\/00061"
     },
     {
      "milestone": "الانتهاء من اعتماد المخططات التفصيلية ",
      "weight": 0.06,
      "rate": 1,
      "id": "PO\/2023\/00062"
     },
     {
      "milestone": "الانتهاء من اعتماد العينات  ",
      "weight": 0.03,
      "rate": 0.75,
      "id": "PO\/2023\/00063"
     },
     {
      "milestone": "الانتهاء من توريدات المواد المعتمدة",
      "weight": 0.06,
      "rate": 0.75,
      "id": "PO\/2023\/00064"
     },
     {
      "milestone": "الانتهاء من الأعمال الترابية والموقع العام لبرج الشنانة",
      "weight": 0.06,
      "rate": 0.6,
      "id": "PO\/2023\/00065"
     },
     {
      "milestone": "الانتهاء من اعمال الخرسانة لبرج الشنانة",
      "weight": 0.06,
      "rate": 0.75,
      "id": "PO\/2023\/00066"
     },
     {
      "milestone": "الانتهاء من أعمال المباني لبرج الشنانة",
      "weight": 0.08,
      "rate": 0.75,
      "id": "PO\/2023\/00067"
     },
     {
      "milestone": "الانتهاء من أعمال العزل لبرج الشنانة",
      "weight": 0.06,
      "rate": 0.75,
      "id": "PO\/2023\/00068"
     },
     {
      "milestone": "الانتهاء من الاعمال الانشائية لبرج الشنانة",
      "weight": 0.09,
      "rate": 0.75,
      "id": "PO\/2023\/00069"
     },
     {
      "milestone": "الانتهاء من الأعمال المعمارية لبرج الشنانة",
      "weight": 0.06,
      "rate": 0.45,
      "id": "PO\/2023\/00070"
     },
     {
      "milestone": "الانتهاء من جميع أعمال الموقع العام لبرج الشنانة",
      "weight": 0.09,
      "rate": 0.45,
      "id": "PO\/2023\/00071"
     },
     {
      "milestone": "الانتهاء من أعمال المعمارية والإنشائية للقصيباء",
      "weight": 0.07,
      "rate": 0.3,
      "id": "PO\/2023\/00072"
     },
     {
      "milestone": "الانتهاء من الأعمال الكهربائية للقصيباء",
      "weight": 0.06,
      "rate": 0,
      "id": "PO\/2023\/00073"
     },
     {
      "milestone": "اغلاق المشروع",
      "weight": 0.09,
      "rate": 0,
      "id": "PO\/2023\/00074"
     }
    ],
   [
     {
      "milestone": "الانتهاء من تجهيز الموقع ",
      "weight": 0.01,
      "rate": 1,
      "id": "PO\/2022\/01210",
      "project": "تهيئة وتأهيل المكونات الأساسية للبيئة العمرانية للمواقع التراثية لقرية الخبراء",
     },
     {
      "milestone": "الانتهاء من اعداد المخططات التنفيذيه ",
      "weight": 0.05,
      "rate": 1,
      "id": "PO\/2022\/01211"
     },
     {
      "milestone": " الانتهاء من اعتماد العينات ",
      "weight": 0.05,
      "rate": 0.95,
      "id": "PO\/2022\/01212"
     },
     {
      "milestone": "الانتهاء من اعمال الفك و الازالات ",
      "weight": 0.05,
      "rate": 1,
      "id": "PO\/2022\/01213"
     },
     {
      "milestone": "الانتهاء من اعمال ترميم الواجهات",
      "weight": 0.05,
      "rate": 0.85,
      "id": "PO\/2022\/01214"
     },
     {
      "milestone": "الانتهاء من اعمال الموقع العام بنسبة 30%",
      "weight": 0.05,
      "rate": 0.8,
      "id": "PO\/2022\/01215"
     },
     {
      "milestone": "الانتهاء من اعمال الموقع العام بنسبة 70%",
      "weight": 0.07,
      "rate": 0.85,
      "id": "PO\/2022\/01216"
     },
     {
      "milestone": "الانتهاء من اعمال الموقع العام بنسبة 100%",
      "weight": 0.07,
      "rate": 0,
      "id": "PO\/2022\/01217"
     },
     {
      "milestone": "الانتهاء من اعمال  توريد وتنفيذ الأبواب والنوافذ الخشبية بنسبة 50%",
      "weight": 0.05,
      "rate": 0.9,
      "id": "PO\/2022\/01218"
     },
     {
      "milestone": "الانتهاء من اعمال  توريد وتنفيذ الأبواب والنوافذ الخشبية بنسبة 100%",
      "weight": 0.05,
      "rate": 0.8,
      "id": "PO\/2022\/01219"
     },
     {
      "milestone": "الانتهاء من اعمال  اللياسات الطينية",
      "weight": 0.05,
      "rate": 0.6,
      "id": "PO\/2022\/01220"
     },
     {
      "milestone": "الانتهاء من توريد و تنفيذ الاعمال  الكهربائيةبنسبة 50%",
      "weight": 0.05,
      "rate": 0.75,
      "id": "PO\/2022\/01221"
     },
     {
      "milestone": "الانتهاء من توريد و تنفيذ الاعمال  الكهربائيةبنسبة 100%",
      "weight": 0.05,
      "rate": 0.25,
      "id": "PO\/2022\/01222"
     },
     {
      "milestone": "الانتهاء من تنفيذ الاعمال الميكانيكية بنسبة 50%",
      "weight": 0.05,
      "rate": 0.45,
      "id": "PO\/2022\/01223"
     },
     {
      "milestone": "الانتهاء من تنفيذ الاعمال الميكانيكية بنسبة 100%",
      "weight": 0.05,
      "rate": 0,
      "id": "PO\/2022\/01224"
     },
     {
      "milestone": "الانتهاء من أعمال العزل المائي",
      "weight": 0.05,
      "rate": 0,
      "id": "PO\/2022\/01225"
     },
     {
      "milestone": "الانتهاء من أعمال الأسقف",
      "weight": 0.1,
      "rate": 0.8,
      "id": "PO\/2022\/01226"
     },
     {
      "milestone": "الانتهاء من اغلاق المشروع",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2022\/01227"
     }
    ],
    [
     {
      "milestone": "الانتهاء من إجراءات استلام الموقع",
      "weight": 0.1,
      "rate": 1,
      "id": "PO\/2023\/01000", 
      "project": "تأهيل وترميم مباني التراث العمراني شرق حديقة الفوطة"
     },
     {
      "milestone": "الانتهاء من اعمال تهيئة الموقع",
      "weight": 0.03,
      "rate": 1,
      "id": "PO\/2023\/01001"
     },
     {
      "milestone": "المبنى التراثي - الانتهاء من أعمال الفك والأزالة",
      "weight": 0.03,
      "rate": 0.05,
      "id": "PO\/2023\/01002"
     },
     {
      "milestone": "الانتهاء من أعتماد المخططات التنفيذية",
      "weight": 0.03,
      "rate": 0.1,
      "id": "PO\/2023\/01003"
     },
     {
      "milestone": "الانتهاء من أعتماد العينات",
      "weight": 0.03,
      "rate": 0.3,
      "id": "PO\/2023\/01004"
     },
     {
      "milestone": "المبنى الحديث - الانتهاء من أعمال الحفر والردم",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2023\/01005"
     },
     {
      "milestone": "المبنى الحديث - الانتهاء من أعمال الخرسانية",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2023\/01006"
     },
     {
      "milestone": "المبنى التراثي -  الانتهاء من أعمال السلالم والدرج",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2023\/01007"
     },
     {
      "milestone": "المبنى التراثي - الانتهاء من أعمال الدور الاول",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2023\/01008"
     },
     {
      "milestone": "المبنى التراثي - الانتهاء من أعمال الدور الارضي",
      "weight": 0.05,
      "rate": 0,
      "id": "PO\/2023\/01009"
     },
     {
      "milestone": "المبنى التراثي - الانتهاء من أعمال تشطيبات الارضيات",
      "weight": 0.05,
      "rate": 0,
      "id": "PO\/2023\/01010"
     },
     {
      "milestone": "المبنى الحديث - الانتهاء من أعمال المبانى",
      "weight": 0.06,
      "rate": 0,
      "id": "PO\/2023\/01011"
     },
     {
      "milestone": "المبنى الحديث - الانتهاء من أعمال الخزان",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2023\/01012"
     },
     {
      "milestone": "الانتهاء من أعمال الميكانيكا",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2023\/01013"
     },
     {
      "milestone": "الانتهاء من أعمال الموقع العام",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2023\/01014"
     },
     {
      "milestone": "المبنى التراثي - الانتهاء من أعمال الابواب والنوافذ",
      "weight": 0.04,
      "rate": 0,
      "id": "PO\/2023\/01015"
     },
     {
      "milestone": "الانتهاء من أعمال الكهرباء",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2023\/01016"
     },
     {
      "milestone": "استلام الموقع",
      "weight": 0.03,
      "rate": 0,
      "id": "PO\/2023\/01017"
     },
     {
      "milestone": "اغلاق المشروع",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2023\/01018"
     }
    ],
    [
     {
      "milestone": "الانتهاء من تسليم الموقع",
      "weight": 0.08,
      "rate": 1,
      "id": "PO\/2022\/01409",
      "project": "ترميم وتأهيل موقع أبراج برزان فى حائل"
     },
     {
      "milestone": "الانتهاء  من الأعمال التجهيزية بالموقع ",
      "weight": 0.1,
      "rate": 0.9,
      "id": "PO\/2022\/01410"
     },
     {
      "milestone": "الانتهاء من المخططات التنفيذية المعمارية",
      "weight": 0.05,
      "rate": 0.9,
      "id": "PO\/2022\/01411"
     },
     {
      "milestone": "الانتهاء من المخططات التنفيذية الإنشائية",
      "weight": 0.05,
      "rate": 0.9,
      "id": "PO\/2022\/01412"
     },
     {
      "milestone": "الانتهاء من المخططات الكهربائية",
      "weight": 0.05,
      "rate": 0.9,
      "id": "PO\/2022\/01413"
     },
     {
      "milestone": "الانتهاء من المخططات الميكانيكية",
      "weight": 0.05,
      "rate": 0.9,
      "id": "PO\/2022\/01414"
     },
     {
      "milestone": "بداية أعمال التنفيذ بالموقع العام",
      "weight": 0.05,
      "rate": 0.9,
      "id": "PO\/2022\/01415"
     },
     {
      "milestone": "اعتماد المواد والعينات",
      "weight": 0.1,
      "rate": 0.9,
      "id": "PO\/2022\/01416"
     },
     {
      "milestone": "الانتهاء من الأعمال الإنشائية والمعمارية",
      "weight": 0.15,
      "rate": 0.86,
      "id": "PO\/2022\/01417"
     },
     {
      "milestone": "الانتهاء من الأعمال الكهربائية",
      "weight": 0.07,
      "rate": 0.85,
      "id": "PO\/2022\/01418"
     },
     {
      "milestone": "الانتهاء من الأعمال الميكانيكية",
      "weight": 0.1,
      "rate": 0.85,
      "id": "PO\/2022\/01419"
     },
     {
      "milestone": "اغلاق المشروع",
      "weight": 0.15,
      "rate": 0,
      "id": "PO\/2022\/01420"
     }
    ],
    [
     {
      "milestone": "الانتهاء من ازالة الانقاض و الحشائش والنباتات  من داخل سور القلعةمن الجهة الجنوبية   ",
      "weight": 0.1,
      "rate": 0.0878,
      "id": "PO\/2023\/00623",
      "project": "تأهيل المواقع الأثرية ( قلعة تاروت - حمام أبو لوزة ) بالمنطقة الشرقية"
     },
     {
      "milestone": "الانتهاء من اعمال التسوية وتخليق الميول اللازمة  لمعاجة المسارات الواصلة للقلعة من البوابات الرئيسية  للادراج والرامبات",
      "weight": 0.1,
      "rate": 1,
      "id": "PO\/2023\/00624"
     },
     {
      "milestone": "الانتهاء من تزرير الشروخ  في جدران القلعة",
      "weight": 0.1,
      "rate": 1,
      "id": "PO\/2023\/00625"
     },
     {
      "milestone": "الانتهاء من توريد وتركيب تباليط من الحجر الطبيعي من حجر المنطقة للمسار الزوار والسلالم  ",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2023\/00626"
     },
     {
      "milestone": "الانتهاء من المباني الحجرية للبمونة الجيرية للجدران من الجهة الشماليه للعين داخل القلعة و امكان الانهيارات في جوانب العين واينما كان ذلك ضروريا حسب راي الاستشاري ",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2023\/00627"
     },
     {
      "milestone": "الانتهاء من الأعمال الإنشائية",
      "weight": 0.1,
      "rate": 0.17,
      "id": "PO\/2023\/00628"
     },
     {
      "milestone": "الانتهاء من الأعمال المعمارية",
      "weight": 0.1,
      "rate": 0.17,
      "id": "PO\/2023\/00629"
     },
     {
      "milestone": "الانتهاء من  توريد وتركيب كشــــــــــــــاف لانارة الواجهات الخارجية للمبني والممرات للســــــــــــــطح  150وات ( IP67  ) حسب المواصفات وتعليمات المهندس المشرف",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2023\/00630"
     },
     {
      "milestone": "الانتهاء من أعمال الموقع العام",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2023\/00631"
     },
     {
      "milestone": "الانتهاء من تنفيذ مركز الزوار ",
      "weight": 0.1,
      "rate": 0,
      "id": "PO\/2023\/00632"
     }
    ]
]